const comments = {
  ratio1: {
    greater:
      "في السنة الحالية زادت نسبة الديون إلى الأصول مقارنة بالسنة الماضية مما يعني إن الشركة أصبحت تعتمد أكثر علي الديون في تمويل أصولها واذا زادت الديون بشكل كبير فقد تواجه الشركة مخاطر سيولة أو مشكلات في السداد مستقبلا",
    less: "في السنة الحالية قلت نسبة الديون مقارنة بالسنة الماضية مما يعني إن الشركة أصبحت اقل اعتمادا علي الديون في تمويل أصولها مما يشير إلي تحسين في الوضع المالي و الاستقرار المالي للشركة",
    equals: "",
  },
  ratio2: {
    greater: `في السنة الحالية زادت نسبة اجمالي الديون إلي اجمالي حقوق الملكية مقارنة بالسنة الماضية مما يعني إن الشركة أصبحت تعتمد اكثر
علي الديون تمويل أنشطتها مما قد يشير الي زياده المخاطر المالية اذا لم يقابلها هذا الارتفاع في نمو الأرباح او تحسين في التدفقات
النقدية قد نوثر ذلك علي قدره الشركة في الوفاء ب التزاماتها المالية و استقرارها في المدي الطويل`,
    less: `في السنه الحالية قلت نسبه اجمالي الديون اجمالي حقوق الملكية مقارنه بالسنة
الماضية مما يعني أن الشركة لا تعتمد علي الديون في تمويل أنشطتها مما يشير الي انخفاض المخاطر المالية`,
    equals: "",
  },
  ratio3: {
    greater: `ارتفاع النسبة يدل علي ان الشركة أصبحت لا تعتمد علي الديون في تمويل أصولها مما
يقلل من مخاطر المالية`,
    less: `انخفاض النسبة يدل علي ان الشركة أصبحت تعتمد علي الديون بشكل اكبر في تمويل أصولها مما يزيد من مخاطر المالية خاصه اذا لم
تكن إيرادات كافيه لخدمه الدين`,
    equals: "",
  },
  ratio4: {
    greater: `زياده معدل تغطيه الأعباء الكلية مقارنة بالسنة الماضية تعني ان الشركة أصبحت اكثر قدرة علي تحمل التزاماتها المالية سواء كانت
فوائد الديون او التكاليف الثابتة الأخرى . هذا يشير الي تحسن الأداء المالي و زيادة القدرة علي الوفاء بالالتزامات دون ضغط مالي كبير
مما يعزز استقرار الشركة و يقلل من مخاطر السيولة`,
    less: `انخفاض معدل تغطيه يعني ان قدره الشركة علي الوفاء بالتزاماتها انخفضت .اذا
استمر النسبة في الانخفاض فقد تواجه الشركة صعوبة في دفع التزاماتها التشغيلية`,
    equals: "",
  },
  ratio5: {
    greater: `ارتفع معدل تغطيه الفوائد هذا العام مقرنه بالسنة الماضية مما يشير الي تحسن قدره
الشركة علي تغطية مصروفات الفوائد من أرباح التشغيلية قد يكون هذا ناتجا عن زياده الأرباح التشغيلية او انخفاض التكاليف التمويل
مما يعزز من استقرار الشركة المالي و يقلل من مخاطر السيولة و الدين`,
    less: `انخفض معدل تغطيه الفوائد هذا العام مقارنه بالسنة الماضية مما يشير الي تراجع قدره الشركة علي تغطيه مصروفات الفوائد من
أرباحها التشغيلية قد تكون هذا ناتج عن انخفاض الأرباح التشغيلية او زياده تكاليف التمويل مما قد تعرض الشركة لمخاطر ماليه اعلي
اذا استمر هذا الاتجاه`,
    equals: "",
  },
  ratio6: {
    greater: `قدره الشركة علي تغطيه التزاماتها الثابتة تحسنت في السنة الحالي مقارنه بالسنة الماضية مما يشير الي زياده الأرباح التشغيلية او
تحسين اداره التكاليف و اذا استمر هذا الاتجاه فسيعزز ذللك استقرار الشركة المالي و قدرتها علي الوفاء بالالتزامات الثابتة بسهوله`,
    less: `هناك انخفاض مما يدل علي زياده الالتزامات الثابتة علي الشركة مثل الإيجارات او
العقود طويله الاجل و اذا استمر الانخفاض فقد يكون هناك ضغط مالي مستقبلا`,
    equals: "",
  },
  ratio7: {
    greater: `الشركة أصبحت تعتمد اكثر علي الديون . مما يزيد من المخاطر المالية لكنه قد يكون مؤشر علي نمو او توسع في الاعمال . يجب التأكد
من ان هذا التوسع سيؤدي الي عوائد تعوض زيادة المخاطر`,
    less: `أصبحت الشركة لا تعتمد علي الديون مما لا يزيد من المخاطر المالية`,
    equals: "",
  },
  ratio8: {
    greater: `يدل ذلك على أن الشركة أكبر قدرة على سداد التزاماتها قصيرة الأجل في السنة الحالية مقارنه بالسنة الاساس`,
    less: `يدل ذلك على أن الشركة أكبر قدرة على سداد التزاماتها قصيرة الأجل في سنة الأساس مقارنه بالسنة الحالية`,
    equals: "",
  },
  ratio9: {
    greater: `يدل ذلك علي ان الشركه اكبر قدره على سداد التزاماتها دون الاعتماد على بيع المخزون في السنه الحالية عن سنه الاساس`,
    less: `يدل ذلك علي ان الشركه اكبر قدره على سداد التزاماتها دون الاعتماد على بيع المخزون في سنه الاساس عن السنه الحالية`,
    equals: "",
  },
  ratio10: {
    greater: `يدل ذلك على ان الشركه كانت اكثر نشاطا في بيع وتجديد مخزونها في السنة الحالية على عكس سنة الأساس`,
    less: `يدل ذلك على ان الشركه كانت اكثر نشاطا في بيع وتجديد مخزونها في سنة الاساس على عكس السنة الحالية`,
    equals: "",
  },
  ratio11: {
    greater: `يدل ذلك على ان الشركه اصبحت اكثر قدره على سداد التزاماتها التشغيليه من التدفق النقدي في السنة الحالية على عكس سنة الاساس`,
    less: `يدل ذلك على ان الشركه اصبحت اكثر قدره على سداد التزاماتها التشغيليه من التدفق النقدي في سنة الاساس على عكس السنة الحالية`,
    equals: "",
  },
  ratio12: {
    greater: `يدل ذلك على ان الشركه اصبحت اكثر قدره على سداد التزاماتها الماليه من التدفق النقدي الحر في السنة الحالية على عكس سنة الاساس`,
    less: `يدل ذلك على ان الشركه اصبحت اكثر قدره على سداد التزاماتها الماليه من التدفق النقدي الحر  في سنة الاساس على عكس السنة الحالية`,
    equals: "",
  },
  ratio13: {
    greater: `يدل ذلك على ان الشركه كانت اكبر قدره على سداد التزاماتها من حقوق المساهمين في السنة الحالية علي عكس سنة الاساس`,
    less: `يدل ذلك على ان الشركه كانت اكبر قدره على سداد التزاماتها من حقوق المساهمين في سنة الاساس على عكس السنة الحالية`,
    equals: "",
  },
  ratio14: {
    greater: `يدل ذلك على ان الشركه كانت اكبر قدره على سداد التزاماتها في السنة الحالية علي عكس سنة الاساس`,
    less: `يدل ذلك على ان الشركه كانت اكبر قدره على سداد التزاماتها في سنة الاساس على عكس السنة الحالية`,
    equals: "",
  },
  ratio15: {
    greater: `يدل ذلك على ان الشركه كانت اكبر قدره على سداد التزاماتها في السنة الحالية علي عكس سنة الاساس`,
    less: `يدل ذلك على ان الشركه كانت اكبر قدره على سداد التزاماتها في سنة الاساس على عكس السنة الحالية`,
    equals: "",
  },
  ratio16: {
    greater: `يدل ذلك على ان الشركه اصبحت اكثر قدره على توفير التمويل اللازم لتمويل انشطتها التشغيليه في السنة الحالية علي عكس سنة الاساس`,
    less: `يدل ذلك على ان الشركه اصبحت اكثر قدره على توفير التمويل اللازم لتمويل انشطتها التشغيليه في سنة الاساس على عكس السنة الحالية`,
    equals: "",
  },
  ratio17: {
    greater: (x) => {
      return (
        `هذا يعنى ان كل جنيه مستثمر في اصول المنشاة يتولد عنه مبيعات صافيه قدرها ` +
        `${x.toFixed(2)} ` +
        `ومن الواضح ان هذا المعدل يفوق معدل دوران الاصول للسنه السابقة وهذا يعنى ان الإدارة تقوم باستغلال الاصول بكفاءة عالية`
      );
    },
    less: (x) => {
      return (
        `هذا يعنى ان كل جنيه مستثمر في اصول المنشاة يتولد عنه مبيعات صافيه قدرها ` +
        `${x.toFixed(2)} ` +
        `ومن الواضح ان هذا المعدل أقل من معدل دوران الاصول للسنه السابقة وهذا يعنى ان الإدارة تقوم باستغلال الاصول بكفاءة أفل`
      );
    },
    equals: "",
  },
  ratio18: {
    greater: (x) => {
      return (
        `هذا يعنى ان كل جنيه مستثمر في الاصول الثابتة يتولد عنه مبيعات صافيه قدرها ` +
        `${x.toFixed(2)} ` +
        `ومن الواضح ان هذا المعدل يفوق معدل دوران الاصول الثابتة للسنه السابقة وهذا يعنى ان الاصول الثابتة كانت سببا في ارتفاع إجمالي الاصول وان الادارة تقوم باستغلال الاصول الثابتة بكفاءة`
      );
    },
    less: (x) => {
      return (
        `هذا يعنى ان كل جنيه مستثمر في الاصول الثابتة يتولد عنه مبيعات صافيه قدرها ` +
        `${x.toFixed(2)} ` +
        `ومن الواضح ان هذا المعدل أقل من معدل دوران الاصول الثابتة للسنه السابقة وهذا يعنى ان الاصول الثابتة كانت سببا في انخفاض إجمالي الاصول وان الادارة تقوم باستغلال الاصول الثابتة بكفاءة أقل`
      );
    },
    equals: "",
  },
  ratio19: {
    greater: (x) => {
      return (
        `هذا يعنى ان كل جنيه مستثمر في الاصول المتداولة يتولد عنه مبيعات صافيه قدرها ` +
        `${x.toFixed(2)} ` +
        `ومن الواضح ان هذا المعدل يفوق معدل دوران الاصول المتداولة للسنه السابقة وهذا يعنى ان الاصول المتداولة كانت سببا في ارتفاع إجمالي الاصول وان الإدارة تقوم باستغلال الاصول المتداولة بكفاء ة كما قد يرجع الى صغر حجم الاستثمار في واحد او اكثر من الاصول المتداولة`
      );
    },
    less: (x) => {
      return (
        `هذا يعنى ان كل جنيه مستثمر في الاصول المتداولة يتولد عنه مبيعات صافيه قدرها ` +
        `${x.toFixed(2)} ` +
        `ومن الواضح ان هذا المعدل أقل من معدل دوران الاصول المتداولة للسنه السابقة وهذا يعنى ان الاصول المتداولة كانت سببا في انخفاض إجمالي الاصول وان الإدارة تقوم باستغلال الاصول المتداولة بكفاءة أقل`
      );
    },
    equals: "",
  },
  ratio20: {
    greater: `وهذا يعنى ان معدل دوران النقدية قد ارتفع بسبب ارتفاع حجم المبيعات وهذا كان نتيجة لارتفاع شامل في كفاءة استغلال عناصر الاصول المتداولة فضلا عن الاصول الثابتة .`,
    less: `وهذا يعنى ان معدل دوران النقدية قد انخفض بسبب انخفاض حجم المبيعات وهذا كان نتيجة لانخفاض شامل في كفاءة استغلال عناصر الاصول المتداولة فضلا عن الاصول الثابتة .`,
    equals: "",
  },
  ratio21: {
    greater: (x) => {
      return (
        `وهذا يعنى ان كل جنيه مستثمر في تقديم ائتمان للعملاء قد حقق مبيعات آجله قدرها ` +
        `${x.toFixed(2)} ` +
        ` ومن الواضح ان هذا المعدل يفوق  معدل دوران أرصده العملاء للسنه السابقة بمعنى ان ترتب على السياسات المتبعة في هذه السنه ارتفاع في المبيعات`
      );
    },
    less: (x) => {
      return (
        `وهذا يعنى ان كل جنيه مستثمر في تقديم ائتمان للعملاء قد حقق مبيعات آجله قدرها ` +
        `${x.toFixed(2)} ` +
        ` ومن الواضح ان هذا المعدل يقل عن معدل دوران أرصده العملاء للسنه السابقة بمعنى ان ترتب على السياسات المتبعة في هذه السنه انخفاض في المبيعات`
      );
    },
    equals: "",
  },
  ratio22: {
    greater: (x) => {
      return (
        `هذا يعنى ان متوسط دوره تحويل فواتير البيع الآجل الى نقديه هي` +
        `${x} يوم` +
        " " +
        `ومن
الواضح ان هذا المتوسط اكبر من متوسط فتره التحصيل للسنه السابقة مما يعنى ان الإدارة تحتاج الى تحسين السياسات المتبعة في تحصيل المبيعات الآجلة من العملاء`
      );
    },
    less: (x) => {
      return (
        `هذا يعنى ان متوسط دوره تحويل فواتير البيع الآجل الى نقديه هي` +
        `${x} يوم` +
        " " +
        `ومن 
الواضح ان هذا المتوسط اقل من متوسط فتره التحصيل للسنه السابقة مما يعنى ان الإدارة قد حسنت السياسات المتبعة في تحصيل المبيعات الآجلة من العملاء`
      );
    },
    equals: "",
  },
  ratio23: {
    greater: (x) => {
      return (
        `وهذا يعنى ان كل جنيه مستثمر في المخزون يتولد عنه مبيعات قدرها ` +
        `${x.toFixed(2)} ` +
        `ومن
الواضح ان هذا المعدل أكبر من معدل دوران المخزون للسنه السابقة بمعنى ان حدث ارتفاع في المبيعات مع انخفاض رصيد المخزون مما ادى الى انخفاض تكلفه البضاعة المباعة`
      );
    },
    less: (x) => {
      return (
        `هذا يعنى ان كل جنيه مستثمر في المخزون يتولد عنه مبيعات  قدرها ` +
        `${x.toFixed(2)} ` +
        `ومن
الواضح ان هذا المعدل أقل من معدل دوران المخزون للسنه السابقة بمعنى ان حدث انخفاض في المبيعات مع ارتفاع رصيد المخزون مما ادى الى ارتفاع تكلفه البضاعة المباعة`
      );
    },
    equals: "",
  },
  ratio24: {
    greater: (x) => {
      return (
        `وهذا يعنى ان البضائع تقضى` +
        `${x} يوم` +
        " " +
        `في المخازن قبل بيعها ومن الواضح ان
هذا المتوسط يفوق متوسط فتره التخزين للسنه السابقة مما يعنى ان الادارة لم تتمكن من التكيف
مع انخفاض الطلب على منتجاتها بل وربما كانت تتوقع ان يرتفع حجم مبيعاتها`
      );
    },
    less: (x) => {
      return (
        `وهذا يعنى ان البضائع تقضى` +
        `${x} يوم` +
        " " +
        `في المخازن قبل بيعها ومن الواضح ان
هذا المتوسط يقل عن متوسط فتره التخزين للسنه السابقة مما يعنى ان الادارة  
تكيفت مع انخفاض الطلب على منتجاتها وربما كانت تتوقع ان ينخفض حجم مبيعاتها`
      );
    },
    equals: "",
  },
  ratio25: {
    greater: (x) => {
      return (
        `وهذا يعنى ان الفترة الزمنية التي قامت فيها الادارة بشراء او تصنيع المخزون وبيع
المنتجات وتحصيل النقدية للبدء في دوره نشاط جديده هي` +
        `${x} يوم` +
        " " +
        `ومن الواضح ان هذه الفترة
تفوق الفترة الزمنية للنشاط التشغيلي للسنه السابقة مما يعنى ان الادارة تحتاج الى تحسين السياسات المتبعة وتحسين كفاءتها وقدرتها على تشغيل وإدارة الاصول`
      );
    },
    less: (x) => {
      return (
        `وهذا يعنى ان الفترة الزمنية التي قامت فيها الادارة بشراء او تصنيع المخزون وبيع
المنتجات وتحصيل النقدية للبدء في دوره نشاط جديده هي` +
        `${x} يوم` +
        " " +
        `ومن الواضح ان هذه الفترة
تقل عن الفترة الزمنية للنشاط التشغيلي للسنه السابقة مما يعنى ان الادارة حسنت السياسات المتبعة و زادت كفاءتها وقدرتها على تشغيل وإدارة الاصول`
      );
    },
    equals: "",
  },
  ratio26: {
    greater: (x) => {
      return (
        `وهذا يعنى ان عدد المرات التي تم فيها الشراء بالأجل من الموردين ودفعت ثمنها
خلال العام قبل ان تشترى بالأجل مره اخرى هي` +
        ` ${x.toFixed(2)} ` +
        `مره`
      );
    },
    less: (x) => {
      return (
        `وهذا يعنى ان عدد المرات التي تم فيها الشراء بالأجل من الموردين ودفعت ثمنها
خلال العام قبل ان تشترى بالأجل مره اخرى هي` +
        ` ${x.toFixed(2)} ` +
        `مره`
      );
    },
    equals: "",
  },
  ratio27: {
    greater: (x) => {
      return (
        `وهذا يعنى ان عدد الايام اللازمة لدفع حسابات الدائنين هي` +
        `${x} يوم` +
        " " +
        `ومن الواضح ان
هذه الفترة تفوق متوسط فترة السداد للسنه السابقة مما يعنى ان الادارة لديها كفاءه في إدارة
عمليه الائتمان لأن طول هذه المدة يكون في مصلحه الشركة طالما يتم الاتفاق مع الموردين
انفسهم ولا يظهر الشركة في صورة متعثرة السداد`
      );
    },
    less: (x) => {
      return (
        `وهذا يعنى ان عدد الايام اللازمة لدفع حسابات الدائنين هي` +
        `${x} يوم` +
        " " +
        `ومن الواضح ان
هذه الفترة تقل عن متوسط فترة السداد للسنه السابقة مما يعنى ان الادارة لديها كفاءه أقل في إدارة
عمليه الائتمان لأن قصر هذه المدة يضر الشركة و يظهر الشركة في صورة متعثرة السداد`
      );
    },
    equals: "",
  },
  ratio28: {
    greater: (x) => {
      return (
        `وهذا يعنى ان الفترة الزمنية التي تستغرقها الشركة لشراء المواد الخام وإنتاج السلع
وبيعها وتحصيل النقدية من العملاء مع مراعاه الفترة الزمنية التي يستغرقها الموردين لتقديم
السلع والخدمات هي` +
        `${x} يوم` +
        " " +
        `ومن الواضح ان هذه الفترة تفوق الفترة الزمنية للدورة التجارية
للسنه السابقة وهذا يعنى ان الشركة لا يتوافر لديها سيوله كافيه من تحصيل المدينين في الفترة
المالية وقد يصعب استخدامها في الشراء بالأجل من الموردين والسداد لهم في نفس الفترة`
      );
    },
    less: (x) => {
      return (
        `وهذا يعنى ان الفترة الزمنية التي تستغرقها الشركة لشراء المواد الخام وإنتاج السلع
وبيعها وتحصيل النقدية من العملاء مع مراعاه الفترة الزمنية التي يستغرقها الموردين لتقديم
السلع والخدمات هي` +
        `${x} يوم` +
        " " +
        `ومن الواضح ان هذه الفترة تقل عن الفترة الزمنية للدورة التجارية
للسنه السابقة وهذا يعنى ان الشركة  يتوافر لديها سيوله كافيه من تحصيل المدينين في الفترة
المالية وقد يسهل استخدامها في الشراء بالأجل من الموردين والسداد لهم في نفس الفترة`
      );
    },
    equals: "",
  },
  ratio29: {
    greater: (current, previous, year) => {
      return `زادت نسبه هامش الربح الاجمالي في سنه ${year} عنها في سنه ${
        year - 1
      } من ${(previous * 100).toFixed(1)}% إلى ${(current * 100).toFixed(
        1
      )}% مما يعني زياده كفاءة الشركة في تحقيق الارباح`;
    },
    less: (current, previous, year) => {
      return `قلت نسبه هامش الربح الاجمالي في سنه ${year} عنها في سنه ${
        year - 1
      } من ${(previous * 100).toFixed(1)}% إلى ${(current * 100).toFixed(
        1
      )}% مما يعني قلة كفاءة الشركة في تحقيق الارباح`;
    },
    equals: "",
  },
  ratio30: {
    greater: (current, previous, year) => {
      return `زادت نسبه هامش الربح التشغيلي في سنه ${year} عنها في سنه ${
        year - 1
      } من ${(previous * 100).toFixed(1)}% إلى ${(current * 100).toFixed(
        1
      )}% مما يعني زياده قدره الشركة علي التحكم في تكاليفها التشغيلية وتحقيق ارباح جيده`;
    },
    less: (current, previous, year) => {
      return `قلت نسبه هامش الربح التشغيلي في سنه ${year} عنها في سنه ${
        year - 1
      } من ${(previous * 100).toFixed(1)}% إلى ${(current * 100).toFixed(
        1
      )}% مما يعني قلة قدره الشركة علي التحكم في تكاليفها التشغيلية وتحقيق ارباح قليله`;
    },
    equals: "",
  },
  ratio31: {
    greater: (current, previous, year) => {
      return `زادت نسبه هامش صافي الربح  في سنه ${year} عنها في سنه ${
        year - 1
      } من ${(previous * 100).toFixed(1)}% إلى ${(current * 100).toFixed(
        1
      )}% مما يدل علي قوة ربحيه الشركة`;
    },
    less: (current, previous, year) => {
      return `قلت نسبه هامش صافي الربح  في سنه ${year} عنها في سنه ${
        year - 1
      } من ${(previous * 100).toFixed(1)}% إلى ${(current * 100).toFixed(
        1
      )}% مما يدل علي ضعف ربحيه الشركة`;
    },
    equals: "",
  },
  ratio32: {
    greater: (current, previous, year) => {
      return `زاد العائد علي إجمالي الاصول في سنه ${year} عنها في سنه ${
        year - 1
      } من ${(previous * 100).toFixed(1)}% إلى ${(current * 100).toFixed(
        1
      )}% مما يعني ان اصبحت الشركة اكتر كفاءة في تحقيق العوائد من الاصول`;
    },
    less: (current, previous, year) => {
      return `قل العائد علي إجمالي الاصول في سنه ${year} عنها في سنه ${
        year - 1
      } من ${(previous * 100).toFixed(1)}% إلى ${(current * 100).toFixed(
        1
      )}% مما يعني ان اصبحت الشركة اقل كفاءة في تحقيق العوائد من الاصول`;
    },
    equals: "",
  },
  ratio33: {
    greater: (current, previous, year) => {
      return `زاد العائد علي حقوق الملكية في سنه ${year} عنها في سنه ${
        year - 1
      } من ${(previous * 100).toFixed(1)}% إلى ${(current * 100).toFixed(
        1
      )}% مما يدل ذلك علي تحقيق عوائد جيده للمستثمرين`;
    },
    less: (current, previous, year) => {
      return `قل العائد علي حقوق الملكية سنه ${year} عنها في سنه ${
        year - 1
      } من ${(previous * 100).toFixed(1)}% إلى ${(current * 100).toFixed(
        1
      )}% مما يدل ذلك علي تحقيق عوائد قليله للمستثمرين`;
    },
    equals: "",
  },
  ratio34: {
    greater: (current, previous, year) => {
      return `زاد العائد علي المبيعات في سنه ${year} عنها في سنه ${
        year - 1
      } من ${(previous * 100).toFixed(1)}% إلى ${(current * 100).toFixed(
        1
      )}% مما يدل ذلك علي كفاءة اعلى في تحقيق ارباح من المبيعات`;
    },
    less: (current, previous, year) => {
      return `قل العائد علي المبيعات في سنه ${year} عنها في سنه ${
        year - 1
      } من ${(previous * 100).toFixed(1)}% إلى ${(current * 100).toFixed(
        1
      )}% مما يدل ذلك علي كفاءة اقل في تحقيق ارباح من المبيعات`;
    },
    equals: "",
  },
};

module.exports = { comments };
